DataProcessors/ОповещениеОСобытияхЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ОповещениеОСобытияхЭДО</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/УчетныеЗаписиЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>УчетныеЗаписиЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеУчетнойЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОператорЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбменаЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочтаДляУведомлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидатьИзвещениеОПолучении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлятьОНовыхПриглашениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлятьОбОтветахНаПриглашения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлятьОНовыхДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлятьОНеОбработанныхДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлятьОбОкончанииСрокаДействияСертификата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресОрганизацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПассивноеСоединениеFTP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПортFTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EmailОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазначениеУчетнойЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробноеОписаниеУчетнойЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьНастройкиУведомлений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыУсловияИспользования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ТранспортныйКонтейнерЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ТранспортныйКонтейнерЭДО</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресРесурсаКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРесурсаОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаТранспортногоКонтейнераЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийУИД</Name>
					<Comment>Уникальный идентификатор объекта во внешней системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеЗашифрованы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНастройкаЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьСоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПрофильНастроекЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьПрофилиНастроекЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбменаЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТранспортныхСообщенийБЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Comment>Для входящих</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРаспаковки</Name>
					<Comment>Для входящих</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодготовки</Name>
					<Comment>Для исходящих</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Для исходящих</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДоговорСКонтрагентомЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокументооборота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПодтвердитьПолучение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСервисаЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСервисовЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьЭлектронныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УдалитьСоглашенияОбИспользованииЭД</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьДанныеЗашифрованы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСертификатШифрования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЭлектронныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлектронныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СообщениеЭДО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ОповещениеОСобытияхЭДО/Forms/РезультатыОтправкиИПолученияДокументов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	ЕстьОшибкиУчетныхЗаписей = Ложь;
	ПараметрыДетализации = Неопределено;
	Если Параметры.Свойство("ПараметрыДетализации", ПараметрыДетализации) Тогда
		
		КонтекстДиагностики = ПараметрыДетализации.КонтекстДиагностики;
		Если Не ДиагностикаЭДОКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
			Элементы.ПровестиДиагностику.Видимость = Ложь;
		КонецЕсли;
		Заголовок = Заголовок + СтрШаблон(" (%1)", Формат(ПараметрыДетализации.КонтекстДиагностики.ДатаНачалаОперации, НСтр("ru = 'ДФ=HH:mm'") ));
		ЗаполнитьУчетныеЗаписи(ПараметрыДетализации, ЕстьОшибкиУчетныхЗаписей);
		ЗаполнитьРезультатыОпераций(ПараметрыДетализации, ЕстьОшибкиУчетныхЗаписей);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобратьОперации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчетныеЗаписи

&НаКлиенте
Процедура УчетныеЗаписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.УчетныеЗаписиСостояниеСинхронизации
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ПодробноеПредставлениеОшибки) Тогда
		ДиагностикаЭДОКлиент.ПоказатьОшибки(НСтр("ru = 'Состояние синхронизации'"),
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элемент.ТекущиеДанные.ПодробноеПредставлениеОшибки));
	ИначеЕсли Поле = Элементы.УчетныеЗаписиНаименование Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.КлючЗаписи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатыОпераций

&НаКлиенте
Процедура РезультатыОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.РезультатыОперацийПредставлениеДокумента Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
	ИначеЕсли Поле = Элементы.РезультатыОперацийОшибка И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ошибка) Тогда
		ПоказатьПредупреждение(, Элемент.ТекущиеДанные.Ошибка);
	ИначеЕсли Поле = Элементы.РезультатыОперацийДокументыУчета Тогда
		КоличествоДокументовУчета = Элемент.ТекущиеДанные.СсылкиНаДокументыУчета.Количество();
		Если КоличествоДокументовУчета > 0 Тогда
			Если КоличествоДокументовУчета = 1 Тогда
				ПоказатьЗначение(, Элемент.ТекущиеДанные.СсылкиНаДокументыУчета[0].Значение);
			Иначе 
				Оповещение = Новый ОписаниеОповещения("ПослеВыбораУчетногоДокумента", ЭтотОбъект);
				Элемент.ТекущиеДанные.СсылкиНаДокументыУчета.ПоказатьВыборЭлемента(Оповещение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Неудачные(Команда)
	
	ОбработатьНажатиеНаКнопкуОтбора(Элементы.Неудачные);
	ОтобратьОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура Успешные(Команда)
	
	ОбработатьНажатиеНаКнопкуОтбора(Элементы.Успешные);
	ОтобратьОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДиагностику(Команда)
	
	КонтекстДиагностики.ОшибкиОбработаны = Ложь;
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРезультатыОпераций(ПараметрыДетализации, ЕстьОшибкиУчетныхЗаписей)
	
	УспешныеДокументы = ПараметрыДетализации.РезультатыОтправкиПолучения.Успешные;
	НеудачныеДокументы = ПараметрыДетализации.РезультатыОтправкиПолучения.Неудачные;
	ЕстьПредупрежденияСтраницыДокументы = Ложь;
	ЕстьПредупрежденияСтраницыУчетныеЗаписи = Ложь;
	Если НеудачныеДокументы.Количество() > 0 Тогда
		Элементы.Неудачные.Пометка = Истина;
		Элементы.СтраницаДокументы.Картинка = БиблиотекаКартинок.НекорректныйКонтрагент;
		ЕстьПредупрежденияСтраницыДокументы = Истина;
	ИначеЕсли УспешныеДокументы.Количество() > 0 Тогда
		Элементы.Успешные.Пометка = Истина;
	КонецЕсли;
	Если ЕстьОшибкиУчетныхЗаписей Тогда
		Элементы.СтраницаУчетныеЗаписи.Картинка = БиблиотекаКартинок.НекорректныйКонтрагент;
		ЕстьПредупрежденияСтраницыУчетныеЗаписи = Истина;
	КонецЕсли;
	
	Если ЕстьПредупрежденияСтраницыДокументы И Не ЕстьПредупрежденияСтраницыУчетныеЗаписи Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДокументы;
	ИначеЕсли Не ЕстьПредупрежденияСтраницыДокументы И ЕстьПредупрежденияСтраницыУчетныеЗаписи Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаУчетныеЗаписи;
	ИначеЕсли ЕстьПредупрежденияСтраницыДокументы И ЕстьПредупрежденияСтраницыУчетныеЗаписи Тогда
		Если РезультатыОпераций.Количество() Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДокументы;
		Иначе 
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаУчетныеЗаписи;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Успешные.Заголовок = СтрШаблон(НСтр("ru = '%1 (%2)'"), Элементы.Успешные.Заголовок, УспешныеДокументы.Количество());
	Элементы.Неудачные.Заголовок = СтрШаблон(НСтр("ru = '%1 (%2)'"), Элементы.Неудачные.Заголовок, НеудачныеДокументы.Количество());
	
	СообщенияИКонтейнеры = Новый Массив;
	Сообщения = Новый Массив;
	Контейнеры = Новый Массив;
	Для каждого УспешныйДокумент Из УспешныеДокументы Цикл
		СообщенияИКонтейнеры.Добавить(УспешныйДокумент.Ссылка);
		Если ТипЗнч(УспешныйДокумент.Ссылка) = Тип("ДокументСсылка.СообщениеЭДО") Тогда
			Сообщения.Добавить(УспешныйДокумент.Ссылка);
		Иначе
			Контейнеры.Добавить(УспешныйДокумент.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Для каждого НеудачныйДокумент Из НеудачныеДокументы Цикл
		СообщенияИКонтейнеры.Добавить(НеудачныйДокумент.Ссылка);
		Если ТипЗнч(НеудачныйДокумент.Ссылка) = Тип("ДокументСсылка.СообщениеЭДО") Тогда
			Сообщения.Добавить(НеудачныйДокумент.Ссылка);
		Иначе
			Контейнеры.Добавить(НеудачныйДокумент.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ОбъектыКонтейнеров = СинхронизацияЭДО.ОбъектыТранспортныхКонтейнеров(Контейнеры);
	Для Каждого КлючИЗначение Из ОбъектыКонтейнеров Цикл
		Для Каждого ОбъектКонтейнера Из КлючИЗначение.Значение Цикл
			Сообщения.Добавить(ОбъектКонтейнера);
			Прервать;
		КонецЦикла;
	КонецЦикла;
	
	СоответствиеСообщенийДокументам = ЭлектронныеДокументыЭДО.ДокументыСообщений(Сообщения);
	ЭлектронныеДокументы = Новый Массив;
	Для Каждого КлючИЗначение Из СоответствиеСообщенийДокументам Цикл
		ЭлектронныеДокументы.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	
	Запросы = Новый Массив;
	
	Отбор = ИнтеграцияЭДО.НовыйОтборОбъектовУчетаЭлектронныхДокументов();
	Отбор.ЭлектронныеДокументы = "&ЭлектронныеДокументы";
	
	ЗапросУчетныхДокументов = ИнтеграцияЭДО.ЗапросОбъектовУчетаЭлектронныхДокументов("УчетныеДокументы", Отбор);
	Запросы.Добавить(ЗапросУчетныхДокументов);
	
	ЗапросПредставленийЭлектронныхДокументооборотов =
		ЭлектронныеДокументыЭДО.ЗапросПараметровПредставленияДокументов(
			"ПредставленияЭлектронныхДокументооборотов", "&СообщенияЭДО");
	Запросы.Добавить(ЗапросПредставленийЭлектронныхДокументооборотов);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеДокументы.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	|	УчетныеДокументы.ОбъектУчета КАК УчетныйДокумент,
	|	УчетныеДокументы.ПредставлениеОбъектаУчета КАК УчетныйДокументПредставление
	|ИЗ
	|	УчетныеДокументы КАК УчетныеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредставленияЭлектронныхДокументооборотов.Ссылка КАК Ссылка,
	|	ПредставленияЭлектронныхДокументооборотов.ВидДокумента КАК ВидЭД,
	|	ПредставленияЭлектронныхДокументооборотов.ДатаДокумента КАК Дата,
	|	ПредставленияЭлектронныхДокументооборотов.НомерДокумента КАК Номер
	|ИЗ
	|	ПредставленияЭлектронныхДокументооборотов КАК ПредставленияЭлектронныхДокументооборотов";
	
	ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, Запросы);
	ИтоговыйЗапрос.УстановитьПараметр("СообщенияЭДО", Сообщения);
	ИтоговыйЗапрос.УстановитьПараметр("ЭлектронныеДокументы", ЭлектронныеДокументы);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = ИтоговыйЗапрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Основания = РезультатЗапроса[2].Выгрузить();
	ВыборкаПредставлениеЭД = РезультатЗапроса[3].Выбрать();
	
	Элементы.СтраницаДокументы.Заголовок = Элементы.СтраницаДокументы.Заголовок + СтрШаблон(" (%1)", СообщенияИКонтейнеры.Количество());
	
	Запросы = Новый Массив;
	ЗапросСостояний = ЭлектронныеДокументыЭДО.ЗапросСостоянийДокументов(
		"СостоянияЭлектронныхДокументооборотов", "&ЭлектронныеДокументы");
	
	Запросы.Добавить(ЗапросСостояний);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияЭлектронныхДокументооборотов.Ссылка КАК Ссылка,
	|	СостоянияЭлектронныхДокументооборотов.Состояние КАК Состояние,
	|	СостоянияЭлектронныхДокументооборотов.СостояниеДополнение КАК СостояниеДополнение
	|ИЗ
	|	СостоянияЭлектронныхДокументооборотов КАК СостоянияЭлектронныхДокументооборотов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТранспортныйКонтейнерЭДО.Ссылка,
	|	ТранспортныйКонтейнерЭДО.Статус,
	|	""""
	|ИЗ
	|	Документ.ТранспортныйКонтейнерЭДО КАК ТранспортныйКонтейнерЭДО
	|ГДЕ
	|	ТранспортныйКонтейнерЭДО.Ссылка В(&Контейнеры)";
	
	ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, Запросы);
	ИтоговыйЗапрос.УстановитьПараметр("Контейнеры", Контейнеры);
	ИтоговыйЗапрос.УстановитьПараметр("ЭлектронныеДокументы", ЭлектронныеДокументы);
	
	РезультатЗапроса = ИтоговыйЗапрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для каждого УспешныйОбъект Из УспешныеДокументы Цикл
		УспешноеСообщение = УспешныйОбъект.Ссылка;
		Если ТипЗнч(УспешноеСообщение) = Тип("ДокументСсылка.ТранспортныйКонтейнерЭДО") Тогда
			ОбъектыКонтейнера = ОбъектыКонтейнеров[УспешноеСообщение];
			Если ОбъектыКонтейнера <> Неопределено И ОбъектыКонтейнера.Количество() Тогда
				УспешноеСообщение = ОбъектыКонтейнера[0];
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока = ДобавитьСтрокуРезультатаОперации(УспешноеСообщение, ВыборкаДетальныеЗаписи,
			ВыборкаПредставлениеЭД, Основания, СоответствиеСообщенийДокументам);
		НоваяСтрока.Картинка = 3;
		НоваяСтрока.ЕстьОшибки = Ложь;
	КонецЦикла;
	
	Для каждого НеудачныйОбъект Из НеудачныеДокументы Цикл
		НеудачноеСообщение = НеудачныйОбъект.Ссылка;
		Если ТипЗнч(НеудачноеСообщение) = Тип("ДокументСсылка.ТранспортныйКонтейнерЭДО") Тогда
			ОбъектыКонтейнера = ОбъектыКонтейнеров[НеудачноеСообщение];
			Если ОбъектыКонтейнера <> Неопределено И ОбъектыКонтейнера.Количество() Тогда
				НеудачноеСообщение = ОбъектыКонтейнера[0];
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока = ДобавитьСтрокуРезультатаОперации(НеудачноеСообщение, ВыборкаДетальныеЗаписи,
			ВыборкаПредставлениеЭД, Основания, СоответствиеСообщенийДокументам, НеудачныйОбъект.Ошибка);
		НоваяСтрока.Картинка = 0;
		НоваяСтрока.ЕстьОшибки = Истина;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчетныеЗаписи(ПараметрыДетализации, ЕстьОшибкиУчетныхЗаписей)
	
	МассивУчетныхЗаписей = Новый Массив;
	Для каждого КлючИЗначение Из ПараметрыДетализации.ОбработанныеУчетныеЗаписи Цикл
		НоваяСтрока = УчетныеЗаписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, КлючИЗначение.Значение);
		Если НоваяСтрока.ОтправкаПолучениеВыполнялись Тогда
			НоваяСтрока.Картинка = 3;
			НоваяСтрока.Порядок = 0;
			НоваяСтрока.СостояниеСинхронизации = НСтр("ru = 'Выполнена'");
		Иначе 
			Если КлючИЗначение.Значение.ПользовательОтказалсяОтОперации Тогда
				НоваяСтрока.Картинка = 2;
				НоваяСтрока.Порядок = 2;
				НоваяСтрока.СостояниеСинхронизации = НСтр("ru = 'Отменена'");
			ИначеЕсли НоваяСтрока.ВидОшибки = ДиагностикаЭДОКлиентСервер.ВидОшибкиОтправкиИПолученияНетДоступныхСертификатов() Тогда 
				НоваяСтрока.Картинка = 1;
				НоваяСтрока.Порядок = 1;
				НоваяСтрока.СостояниеСинхронизации = КлючИЗначение.Значение.ИнформацияОбОшибке.КраткоеПредставление;
				НоваяСтрока.ПодробноеПредставлениеОшибки = КлючИЗначение.Значение.ИнформацияОбОшибке;
			Иначе 
				НоваяСтрока.Картинка = 0;
				НоваяСтрока.Порядок = 1;
				НоваяСтрока.СостояниеСинхронизации = КлючИЗначение.Значение.ИнформацияОбОшибке.КраткоеПредставление;
				НоваяСтрока.ПодробноеПредставлениеОшибки = КлючИЗначение.Значение.ИнформацияОбОшибке;
				ЕстьОшибкиУчетныхЗаписей = Истина;
			КонецЕсли;
		КонецЕсли;
		МассивУчетныхЗаписей.Добавить(КлючИЗначение.Значение.Идентификатор);
	КонецЦикла;
	УчетныеЗаписи.Сортировать("Порядок Возр");
	
	Элементы.СтраницаУчетныеЗаписи.Заголовок = Элементы.СтраницаУчетныеЗаписи.Заголовок + СтрШаблон(" (%1)", УчетныеЗаписи.Количество());
	
	Отбор = УчетныеЗаписиЭДО.НовыйОтборУчетныхЗаписей();
	Отбор.УчетныеЗаписи = "&УчетныеЗаписи";
	ЗапросУчетныхЗаписей = УчетныеЗаписиЭДО.ЗапросУчетныхЗаписей("УчетныеЗаписи", Отбор);
	Запросы = Новый Массив;
	Запросы.Добавить(ЗапросУчетныхЗаписей);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УчетныеЗаписи.ИдентификаторЭДО,
	|	УчетныеЗаписи.НаименованиеУчетнойЗаписи
	|ИЗ
	|	УчетныеЗаписи КАК УчетныеЗаписи";
	
	ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, Запросы);
	ИтоговыйЗапрос.УстановитьПараметр("УчетныеЗаписи", МассивУчетныхЗаписей);
	
	Выборка = ИтоговыйЗапрос.Выполнить().Выбрать();
	
	Для каждого УчетнаяЗапись Из УчетныеЗаписи Цикл
		Если Выборка.НайтиСледующий(УчетнаяЗапись.Идентификатор, "ИдентификаторЭДО") Тогда
			УчетнаяЗапись.Наименование = Выборка.НаименованиеУчетнойЗаписи;
			ЗначенияКлюча = Новый Структура("ИдентификаторЭДО", УчетнаяЗапись.Идентификатор);
			УчетнаяЗапись.КлючЗаписи = РегистрыСведений.УчетныеЗаписиЭДО.СоздатьКлючЗаписи(ЗначенияКлюча);
			Выборка.Сбросить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуРезультатаОперации(СообщениеЭДО, ВыборкаДетальныеЗаписи, ВыборкаПредставлениеЭД, Основания,
	СоответствиеСообщенийДокументам, Ошибка = "")
	
	ЭлектронныйДокумент = СоответствиеСообщенийДокументам[СообщениеЭДО];
	Если ЭлектронныйДокумент = Неопределено Тогда
		ЭлектронныйДокумент = СообщениеЭДО;
	КонецЕсли;
	
	НоваяСтрока = РезультатыОпераций.Добавить();
	НоваяСтрока.Документ = ЭлектронныйДокумент;
	НоваяСтрока.Картинка = 3;
	НоваяСтрока.Ошибка = Ошибка;
	Если ВыборкаДетальныеЗаписи.НайтиСледующий(ЭлектронныйДокумент, "Ссылка") Тогда
		НоваяСтрока.ПредставлениеСостояния = "" + ВыборкаДетальныеЗаписи.Состояние + " " + ВыборкаДетальныеЗаписи.СостояниеДополнение;
		ВыборкаДетальныеЗаписи.Сбросить();
	КонецЕсли;
	
	Если (ТипЗнч(ЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО")
		Или ТипЗнч(ЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО"))
		И ВыборкаПредставлениеЭД.НайтиСледующий(СообщениеЭДО, "Ссылка") Тогда
		НоваяСтрока.ПредставлениеДокумента = СтрШаблон(НСтр("ru = '%1 №%2 от %3'"),
			ВыборкаПредставлениеЭД.ВидЭД,
			ВыборкаПредставлениеЭД.Номер,
			Формат(ВыборкаПредставлениеЭД.Дата, "ДЛФ=D"));
		ВыборкаПредставлениеЭД.Сбросить();
	Иначе 
		НоваяСтрока.ПредставлениеДокумента = ЭлектронныйДокумент;
	КонецЕсли;
	
	ОтборЭД = Новый Структура("ЭлектронныйДокумент", НоваяСтрока.Документ);
	ОснованияЭД = Основания.НайтиСтроки(ОтборЭД);
	
	Если ЗначениеЗаполнено(ОснованияЭД) Тогда
		Для каждого ОснованиеЭД Из ОснованияЭД Цикл
			НоваяСтрока.СсылкиНаДокументыУчета.Добавить(ОснованиеЭД.УчетныйДокумент);
		КонецЦикла; 
		Представление = "";
		КоличествоОснований = ОснованияЭД.Количество();
		Если КоличествоОснований = 1 Тогда
			Представление = ОснованияЭД[0].УчетныйДокументПредставление;
		Иначе
			ШаблонСтроки = НСтр("ru = ';%1 документ;;%1 документа;%1 документов;%1 документов'");
			Представление = СтрокаСЧислом(ШаблонСтроки, КоличествоОснований, ВидЧисловогоЗначения.Количественное);
		КонецЕсли;
		НоваяСтрока.ОтражениеВУчете = Представление;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление() 
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РезультатыОпераций.ЕстьОшибки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("РезультатыОперацийОшибки");
	
	//
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РезультатыОпераций.ЕстьОшибки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("РезультатыОперацийОшибки");
	
	//
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УчетныеЗаписи.Картинка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокКартинок = Новый СписокЗначений;
	СписокКартинок.Добавить(0);
	СписокКартинок.Добавить(1);
	ОтборЭлемента.ПравоеЗначение = СписокКартинок;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("УчетныеЗаписиСостояниеСинхронизации");
	
	//
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УчетныеЗаписи.Картинка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокКартинок = Новый СписокЗначений;
	СписокКартинок.Добавить(2);
	СписокКартинок.Добавить(3);
	ОтборЭлемента.ПравоеЗначение = СписокКартинок;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("УчетныеЗаписиСостояниеСинхронизации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеНаКнопкуОтбора(Кнопка) 
	
	Кнопка.Пометка = Не Кнопка.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьОперации() 
	
	Успешные = Элементы.Успешные.Пометка;
	Неуспешные = Элементы.Неудачные.Пометка;
	
	Если (Успешные И Неуспешные)
		Или (Не Успешные И Не Неуспешные) Тогда
		
		ОтборСтрок = Неопределено;
		
	Иначе
		Если Успешные Тогда
			ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьОшибки", Ложь);
		Иначе
			ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьОшибки", Истина);
		КонецЕсли;
	КонецЕсли;
		
	Элементы.РезультатыОпераций.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораУчетногоДокумента(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

#КонецОбласти
